Autodesk.Revit.DB.Architecture.StairsRunStyle
The shape of a run. Different shape has different ways of manipulation.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunStyle.Spiral
A spiral run is defined by a cylindrical helix. Both inner and outer boundaries are arcs. Risers are straight lines.

Autodesk.Revit.DB.Architecture.StairsRunStyle.Straight
A straight run is defined by a straight line. All treads are rectangular.

Autodesk.Revit.DB.Architecture.StairsRunStyle.Sketched
A sketched run can have customized boundary and riser curves. User can customize stair path as well.

Autodesk.Revit.DB.Architecture.StairsRunStyle.Winder
A winder run has distorted treads, for the sake of space saving at corner.